app/views/reunions/show.html.erb

SELECT `estudiantes`.* FROM `estudiantes` WHERE (id = 0)
---
  <b>Estudiante:</b>
  <% vec_estudiante = Estudiante.find(:all, :conditions => [ "id = ?", @reunion.estudiantes_id ])%>