app/controllers/compromisos_controller.rb

  def new
    if params[:tesisId].nil? then
      @tesis = Tese.all
    else
      @tesis = Tese.find(params[:tesisId])
    end

    @compromiso = Compromiso.new
    @estudiantes = Estudiante.find_all_by_tesis_id(params[:tesisId])
---
SELECT `estudiantes`.* FROM `estudiantes` WHERE `estudiantes`.`tesis_id` IS NULL