app/controllers/reunions_controller.rb

SELECT `reunions`.* FROM `reunions` WHERE `reunions`.`id` = 1 LIMIT 1
---
  def show
    @reunion = Reunion.find(params[:id])

INSERT INTO `reunions` (`asunto_reu`, `created_at`, `duracion_reu`, `estudiantes_id`, `fecha_reu`, `lugar`, `profesors_id`, `teses_id`, `updated_at`) VALUES ('nombre ejemplo 1', '2013-04-18 00:38:18', '2013-04-18 03:00:00', 0, '2013-04-17 15:30:00', 'ML-508', 0, NULL, '2013-04-18 00:38:18')
---
  def create
    @reunion = Reunion.new(params[:reunion])
    asistente_ids = params[:asistente_ids]

    respond_to do |format|
      if @reunion.save