app/controllers/teses_controller.rb

SELECT `teses`.* FROM `teses` WHERE `teses`.`id` = 1 LIMIT 1
---
  def show
    @tese = Tese.find(params[:id])

INSERT INTO `teses` (`areaInvestigacion`, `created_at`, `descripcionTesis`, `fechaFin`, `fechaInicio`, `finalizado`, `nombreTesis`, `profesor_id`, `updated_at`) VALUES ('area de ivestigacion 1', '2013-04-18 00:21:47', 'Ejemplo de descripcion de tesis', '2013-07-22', '2013-04-22', 0, 'Ejemplo de tesis', NULL, '2013-04-18 00:21:47')
---
  def create
    @tese = Tese.new(params[:tese])

    respond_to do |format|
      if @tese.save